## Statistical Learning
## I594201 Oscar Melchor
## Tarea I

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
#carga el primer dataset

# Crea la funcion Fix_NaN_If_OK

In [ ]:
def Fix_NaN_If_OK ( df, limite = 0.2, metrica = 'M'):

#Identifica las columnas del dataset recibido en los parametros
    colnames = df.columns
    corregidas = []
    totcorregidas = 0

#Evalua si las columnas son numericas y si aplica que sean reemplazados los NaN
    for col in colnames:
        if (df[col].dtypes == 'float64'):
            nulos = df[col].isnull().mean()
            if ((nulos > 0) and (nulos <= limite)):
                if ((metrica == 'P') or (metrica == 'p')):
                    valor = np.round(df[col].mean(), 0)
                if ((metrica == 'M') or (metrica == 'm')):
                    valor = np.round(df[col].median(), 0)
                
                # luego de la validacion acá corrige los NaN
                df[col] = df[col].fillna(valor)  
                
                corregidas.append(col)
                totcorregidas != 1 

    return df,totcorregidas

## Carga el primer dataset

In [ ]:
df_original = pd.read_excel("Z:\\220427NumerosGenerados.xlsx")
df_original.head()

In [ ]:
df_corregido = df_original.copy()

df_corregido, corregidas = Fix_NaN_If_OK(df_corregido, 0.05, 'P')

In [ ]:
df_original.head()

In [ ]:
df_corregido.head()

# Trabaja el segundo Dataset

In [137]:
df_original_2 = pd.read_excel("Z:\\220427_Tipos_De_Cambio.xlsx")
df_original_2.head()

       Fecha      US$     EUR     LIB
0 2019-01-01  7.73695     NaN     NaN
1 2019-01-02  7.73248  1.1383  1.2619
2 2019-01-03  7.73020  1.1368  1.2591
3 2019-01-04  7.72824  1.1362  1.2635
4 2019-01-05  7.72824     NaN     NaN

In [138]:
df_corregido_2 = df_original_2.copy()

df_corregido_2, corregidas = Fix_NaN_If_OK(df_corregido_2, 0.5, 'M')

In [139]:
df_original_2.head()

       Fecha      US$     EUR     LIB
0 2019-01-01  7.73695     NaN     NaN
1 2019-01-02  7.73248  1.1383  1.2619
2 2019-01-03  7.73020  1.1368  1.2591
3 2019-01-04  7.72824  1.1362  1.2635
4 2019-01-05  7.72824     NaN     NaN

In [140]:
df_corregido_2.head()

       Fecha      US$     EUR     LIB
0 2019-01-01  7.73695  1.0000  1.0000
1 2019-01-02  7.73248  1.1383  1.2619
2 2019-01-03  7.73020  1.1368  1.2591
3 2019-01-04  7.72824  1.1362  1.2635
4 2019-01-05  7.72824  1.0000  1.0000

In [ ]:
del df_original
del df_corregido
del df

# Trabaja 3r DataSet

In [142]:
df_original_3 = pd.read_excel("Z:\\220427_Inflacion_GT.xlsx")
df_original_3.head()

    AÑO  INFLACION
0  1980       9.01
1  1981        NaN
2  1982      -2.07
3  1983       7.15
4  1984       7.24

In [143]:
df_corregido_3 = df_original_3.copy()

df_corregido_3, corregidas = Fix_NaN_If_OK(df_corregido_3, 0.5, 'M')

In [144]:
df_original_3.head()

    AÑO  INFLACION
0  1980       9.01
1  1981        NaN
2  1982      -2.07
3  1983       7.15
4  1984       7.24

In [145]:
df_corregido_3.head()

    AÑO  INFLACION
0  1980       9.01
1  1981       7.00
2  1982      -2.07
3  1983       7.15
4  1984       7.24